[
    {
      "name": "Tenzin Dawa" ,
      "role" : "Executive Director, TCHRD",
      "content" : "The Tibetan Centre for Human Rights and Democracy operates in a highly challenging environment where human rights monitoring comes with the constant risk of surveillance, privacy violations, and cyberattacks including malware and phishing attempts by Chinese government agents seeking to compromise our records, resources, and information. Without a strong digital security support, our work would be even more vulnerable. The guidance and timely assistance of TibCert have been instrumental in safeguarding not only NGO's like ours but also many other stakeholders in the Tibetan community."
    },
    {
      "name": "Wangden Kyab" ,
      "role" : "Research Manager,Tibet Watch",
      "content" : "The Tibet Action Institute and Tibcert team have been instrumental in providing comprehensive training on internet fundamentals, best practices, and cybersecurity protocols. Their ongoing support extends beyond regular workshops, offering timely assistance to address emerging digital security concerns. Most notably, they have demonstrated exceptional dedication in resolving various technical challenges, providing prompt and effective solutions for all computer-related issues. We extend our sincere gratitude for their invaluable service and unwavering commitment to our digital well-being."
    },
    {
        "name": "Kunchok Migmar (Mr.)" ,
        "role" : "Tibetan Settlement Officer, Dharamshala H.P",
        "content" : "TibCERT is one of the most active and important digital security organizations in our Tibetan Community. In today’s world, people heavily rely on technology for everyday work, activities and other conveniences. Therefore, their role in protection and defending against malicious attacks by hackers, spammers, and cybercriminals from internet-connected devices and services is a necessity for every Tibetan Organisations and offices  including our Tibetan Settlement Office. I applaud their unwavering dedication to strengthening digital security and spreading its awareness in our community. We are grateful for their support and reliable services including their annual workshops on digital security and updates. My best wishes to the team for their continued success."
      },
      {
        "name": "Gonpo Dhondup" ,
        "role" : "President, Tibetan Youth Congress",
        "content" : "Tibetcert has been instrumental in strengthening the Tibetan Youth Congress’s digital security and assisting us with technical issues. We greatly appreciate their timely support, expertise in digital empowerment, and dedication to resolving technical challenges."
      },
      {
        "name": "Tenzin Paldon" ,
        "role" : "Editor in chief, Voice of Tibet",
        "content" : "VOT has worked with TibCERT for more than a decade. Apart from supporting our digital security needs and providing guidance and support for different technical needs, TibCERT has been instrumental in managing our website, analyzing our statistics and in providing feedback and solutions for enhanced engagement with our viewers."
      },
      {
        "name": "Ven. Palden Gyatso" ,
        "role" : "Drepung Gomang, Mundgod Tibetan Settlement",
        "content" : "I have attended two Digital Security Workshops organized by TibCERT, the Tibetan Action Institute. The sincere teachings by the trainers during both sessions have been very helpful to me. In particular, the support and guidance from the Digital Security Ambassador in the southern Mundgod Tibetan Settlement were invaluable. Your work is incredibly important in our society today, and I am truly grateful for it."
      },
      {
        "name": "Ven. Namgyal" ,
        "role" : "Sera Jey Monastic University, Bylakuppe Tibetan Settlement",
        "content" : "Thanks to the Tibet Action Institute's program TibCERT, we at Sera Thekchen Ling monastery have learned valuable internet and computer security practices. The Digital Security training has helped both our organization and individual monks, especially with computer and mobile security. We're grateful for your support and request continued assistance."
      },
      {
        "name": "Ven. Tsering Chogyal" ,
        "role" : "Gaden Shartse Monastery, Mundgod Tibetan Settlement",
        "content" : "I have attended multiple workshops and training sessions provided by TIBCRET, which focuses on enhancing digital security awareness within the Tibetan community. Their services are crucial in protecting against cyber threats, especially by alerting the community to potential risks such as viruses and other digital attacks. Through these workshops, I have gained valuable knowledge about online safety, secure communication, and best practices for protecting personal and community data. The information provided has been practical and easy to apply, helping me improve my digital security habits. Overall, TIBCRET plays a significant role in safeguarding the Tibetan community’s digital presence. Their timely alerts and educational initiatives are highly beneficial, and I appreciate their continued efforts in promoting cybersecurity awareness."
      },
      {
        "name": "Tenzin Passang" ,
        "role" : "National Director,SFT  India",
        "content" : "TibCERT has been a true digital warrior, a vital shield protecting Tibetan communities from malicious attacks, especially those originating from the CCP.  SFT-India recognizes digital security as an integral practice and, for this reason, has consistently placed our trust in TibCERT and Tibet Action Network for guidance on our digital security policies."
      },
      
      {
        "name": "Geshe Lhakdor" ,
        "role" : "Library of Tibetan Works and Archives - LTWA",
        "content" : "The Library of Tibetan Works & Archives deeply appreciates the invaluable services provided by the Tibetan Computer  Emergency Readiness Team (TibCERT) to the community. Over the years, whether in preventing or mitigating online threats or offering cyber security awareness training, they have been our trusted experts. We feel confident reaching out to them whenever we need assistance with cyber security. "
      }
      
      

]